Rhino.Inside.Revit API
GeometryEncoder.ToSolid Method
Overload List
Name | Description
ToSolid(Brep)
 Converts the specified Rhino.Geometry.Brep to an equivalent of Autodesk.Revit.DB.Solid.
ToSolid(Extrusion)
 Converts the specified Rhino.Geometry.Extrusion to an equivalent of Autodesk.Revit.DB.Solid.
ToSolid(Mesh)
 Converts the specified Rhino.Geometry.Mesh to an equivalent of Autodesk.Revit.DB.Solid.
ToSolid(SubD)
 Converts the specified Rhino.Geometry.SubD to an equivalent of Autodesk.Revit.DB.Solid.
Top
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace